# RebarBendRadiusTooBig Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarBendRadiusTooBig Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Bend Radius is too big. Ignoring bend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarBendRadiusTooBig { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarBendRadiusTooBig As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarBendRadiusTooBig {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace